# ETL: Extract, Transform, Load Project

A major requirement for data scientist is to have the ability to extract multiple types of data from multiple soures, transform; 
meaning clean and structure the data into a desired form, then load the data into a database for future use. This project demonstrates the ETL process.

### Webscraping nj.gov website for all New Jersey cities and ZIP Codes

In [2]:
%matplotlib inline

In [3]:
#Import Relevant Libraries
from bs4 import BeautifulSoup as BS
import requests
import pandas as pd
import os 
import json
import psycopg2
from config import password
from config import user
import matplotlib.pyplot as plt
import seaborn as sns
from sqlalchemy import inspect
from sqlalchemy.ext.automap import automap_base
from sqlalchemy import create_engine

#### I. First source employees webscraping to collect all New Jersey Zip codes and Cities from Official State of New Jersey website

In [34]:
#URL of page to be scarped
url = "https://nj.gov/nj/gov/direct/njzips.html"    #Official Site of the State of New Jersey--Zip Codes
#retrieve page with request module
response = requests.get(url)
#Create a Beautiful Soup object
soup_njzips = BS(response.text, 'html.parser')
#Find all td tags in soup variable
tds = soup_njzips.find_all('td')

In [35]:
#Split tds list into 2 separate list 
ZIP_Codes = []
Post_Office = []
count = 0

for td in tds:
    
    if count == 2:
        count = 0
    else:
        if count == 0:
            ZIP_Codes.append(td.text)
            count += 1
        elif count == 1:
            Post_Office.append(td.text)
            count +=1

In [36]:
#Transforms our two liist into a single database
Jersey_cizips = pd.DataFrame({"Cities" : Post_Office,
                              "Zipcode": ZIP_Codes})

In [37]:
#Changing data types
Jersey_cizips['Zipcode'] = Jersey_cizips['Zipcode'].astype(str).str.zfill(5)
Jersey_cizips['Cities'] = Jersey_cizips['Cities'].astype(str)
Jersey_cizips.astype(str).dtypes

Cities     object
Zipcode    object
dtype: object

In [38]:
#Cleaning Data
Jersey_cizips_df =Jersey_cizips.drop(0)
zips = Jersey_cizips_df.drop_duplicates().reset_index().drop(columns=['index'])

In [39]:
# Save as a csv
path = ".\Output_Data"
zips.to_csv(os.path.join(path, 'zips.csv'))

In [4]:
# Connecct to postgres database
str_eng= f"postgresql://{user}:{password}@localhost:5432/New Jersey Data"
#print(str_eng)
engine = create_engine(str_eng)

In [41]:
#Export Table to Postgres Database
zips.to_sql(name='Zips', con=engine, if_exists='append', index=False)

#### ii. CSV file uploads

In [58]:
#Reading Census Buearu Economic Data into notebook
highest_paid = pd.read_csv('Resources/Highest Paid.csv')
Median_Household_Income = pd.read_csv('Resources/Median Household Income.csv')
Wage_Gender_Common_Jobs = pd.read_csv('Resources/Wage by Gender in Common Jobs.csv')
Wage_Distribution = pd.read_csv('Resources/Wage Distribution.csv')

##### A. CSV Source One

In [16]:
#Explore data

In [18]:
highest_paid.head()

,ID Detailed Occupation,Detailed Occupation,ID Year,Year,ID Workforce Status,Workforce Status,Total Population,Total Population MOE Appx,Average Wage,Average Wage Appx MOE,ygopop RCA,Record Count,Slug Detailed Occupation,Geography,ID Geography,Slug Geography
0,291240,Surgeons,2018,2018,True,True,2442,1212.900062,346181.811220,126078.753693,1.601845,28,surgeons,New Jersey,04000US34,new-jersey
1,113131,Training & development managers,2015,2015,True,True,1449,934.402396,252478.138026,156355.777010,0.777204,14,training-development-managers,New Jersey,04000US34,new-jersey
2,291060,Physicians & surgeons,2017,2017,True,True,27972,4092.911705,242150.003325,27156.869530,1.050649,314,physicians-surgeons,New Jersey,04000US34,new-jersey
3,413031,"Securities, commodities, & financial services ...",2018,2018,True,True,13990,2899.215398,238809.692781,45880.602148,2.166502,155,securities-commodities-financial-services-sale...,New Jersey,04000US34,new-jersey
4,291060,Physicians & surgeons,2016,2016,True,True,26217,3962.966655,237672.012435,29676.008581,1.025195,288,physicians-surgeons,New Jersey,04000US34,new-jersey

In [20]:
highest_paid.count()

ID Detailed Occupation       2062
Detailed Occupation          2062
ID Year                      2062
Year                         2062
ID Workforce Status          2062
Workforce Status             2062
Total Population             2062
Total Population MOE Appx    2062
Average Wage                 2062
Average Wage Appx MOE        2062
ygopop RCA                   2062
Record Count                 2062
Slug Detailed Occupation     2062
Geography                    2062
ID Geography                 2062
Slug Geography               2062
dtype: int64

In [21]:
highest_paid['Detailed Occupation'].value_counts()

Firstline supervisors of police & detectives                                               5
Medical transcriptionists                                                                  5
Word processors & typists                                                                  5
Industrial & refractory machinery mechanics                                                5
Customer service representatives                                                           5
                                                                                          ..
Nuclear medicine technologists and medical dosimetrists                                    1
Other assemblers and fabricators                                                           1
Nursing assistants                                                                         1
Healthcare social workers                                                                  1
Cutting, punching, and press machine setters, operators, and tenders, metal and plastic    1
Name: Detailed Occupation, Length: 564, dtype: int64

In [22]:
highest_paid_df = highest_paid.sort_values(['Average Wage'], ascending=False).head(10)

In [23]:
highest_paid_df['Detailed Occupation'].value_counts()

Physicians & surgeons                                         3
Training & development managers                               1
Securities, commodities, & financial services sales agents    1
Chief executives & legislators                                1
Podiatrists                                                   1
Other financial specialists                                   1
Physicians                                                    1
Surgeons                                                      1
Name: Detailed Occupation, dtype: int64

In [24]:
highest_paid_df['ID Year']==2018

0     True
1    False
2    False
3     True
4    False
5     True
6     True
7     True
8    False
9     True
Name: ID Year, dtype: bool

In [25]:
highest_paid_slim = highest_paid_df.loc[highest_paid_df['ID Year']==2018]

In [26]:
highest_paid_slim = highest_paid_slim[['Detailed Occupation','Year','Average Wage','Average Wage Appx MOE','Record Count','Geography']]

In [27]:
highest_paid_slim = highest_paid_slim.reset_index()

In [28]:
highest_paid_slim = highest_paid_slim.drop(columns=['index'])

In [29]:
# Save as a csv
path = ".\Output_Data"
highest_paid_slim.to_csv(os.path.join(path, 'Highest Paying Jobs in NJ.csv'))

In [32]:
#Export Table to Postgres Database
highest_paid_slim.to_sql(name='Highest_Paying', con=engine, if_exists='append', index=False)

##### B. CSV Source Two

In [59]:
#Clean median household data
Median_Household_Income.head()

,ID Year,Year,Household Income by Race,Household Income by Race Moe,Geography,ID Geography,Slug Geography
0,2018,2018,81740,687.0,New Jersey,04000US34,new-jersey
1,2018,2018,78478,729.0,"New York-Newark-Jersey City, NY-NJ-PA",31000US35620,new-york-northern-new-jersey-long-island-ny-nj...
2,2018,2018,67844,637.0,New York,04000US36,new-york
3,2018,2018,61937,94.0,United States,01000US,united-states
4,2018,2018,60905,315.0,Pennsylvania,04000US42,pennsylvania

In [60]:
#Edit data frame to contain relevant information
Median_Household_Income_Race = Median_Household_Income[['Year','Household Income by Race','Geography']].copy()
Median_Household_Income_Race.head(7)

   Year  Household Income by Race                                    Geography
0  2018                     81740                                   New Jersey
1  2018                     78478        New York-Newark-Jersey City, NY-NJ-PA
2  2018                     67844                                     New York
3  2018                     61937                                United States
4  2018                     60905                                 Pennsylvania
5  2018                     70747  Philadelphia-Camden-Wilmington, PA-NJ-DE-MD
6  2018                     64805                                     Delaware

In [51]:
# Save as a csv
path = ".\Output_Data"
Median_Household_Income_Race.to_csv(os.path.join(path, 'Median_Household_Income_Race.csv'))

In [53]:
#Export Table to Postgres Database
Median_Household_Income_Race.to_sql(name='Median_Household_Income_Race', con=engine, if_exists='append', index=False)

#### C.CSV Source Three

In [56]:
#Visualize data set
Wage_Gender_Common_Jobs.head()

,ID Gender,Gender,ID Year,Year,ID Employment Time Status,Employment Time Status,ID Detailed Occupation,Detailed Occupation,Average Wage,Average Wage Appx MOE,Total Population,Total Population MOE Appx,Record Count,Geography,ID Geography,Slug Geography
0,1,Male,2018,2018,1,Full-time,533030,Driver/sales workers & truck drivers,53894.578303,4662.225598,79173,6829.999193,639,New Jersey,04000US34,new-jersey
1,2,Female,2018,2018,1,Full-time,533030,Driver/sales workers & truck drivers,47931.976408,21800.029358,4154,1581.435393,31,New Jersey,04000US34,new-jersey
2,2,Female,2018,2018,1,Full-time,412031,Retail salespersons,43984.466022,8839.108611,23044,3714.724912,207,New Jersey,04000US34,new-jersey
3,2,Female,2018,2018,1,Full-time,1191XX,Other managers,104982.016869,9984.577737,41971,4999.691939,449,New Jersey,04000US34,new-jersey
4,2,Female,2018,2018,1,Full-time,252020,Elementary & middle school teachers,63685.354714,2539.277005,91017,7310.451260,993,New Jersey,04000US34,new-jersey

In [62]:
Wage_Gender_Common_Jobs['Detailed Occupation'].value_counts()

Registered nurses                       10
Driver/sales workers & truck drivers    10
Retail salespersons                     10
Elementary & middle school teachers     10
Other managers                           2
Name: Detailed Occupation, dtype: int64

In [69]:
Wage_Gender_Common_Jobs_df = Wage_Gender_Common_Jobs[['Gender','Year','Detailed Occupation','Total Population','Record Count','Geography']]

In [77]:
#Seperate the dataframe into male/female
Wage_by_gender_common_job_female = Wage_Gender_Common_Jobs_df.loc[Wage_Gender_Common_Jobs_df['Gender']=='Female',:]
Wage_by_gender_common_job_male = Wage_Gender_Common_Jobs_df.loc[Wage_Gender_Common_Jobs_df['Gender']=='Male',:]

In [74]:
Wage_by_gender_common_job_female.head()

,Gender,Year,Detailed Occupation,Total Population,Record Count,Geography
1,Female,2018,Driver/sales workers & truck drivers,4154,31,New Jersey
2,Female,2018,Retail salespersons,23044,207,New Jersey
3,Female,2018,Other managers,41971,449,New Jersey
4,Female,2018,Elementary & middle school teachers,91017,993,New Jersey
9,Female,2018,Registered nurses,68999,723,New Jersey

In [78]:
Wage_by_gender_common_job_male.head()

,Gender,Year,Detailed Occupation,Total Population,Record Count,Geography
0,Male,2018,Driver/sales workers & truck drivers,79173,639,New Jersey
5,Male,2018,Registered nurses,9366,91,New Jersey
6,Male,2018,Retail salespersons,33038,311,New Jersey
7,Male,2018,Other managers,77553,793,New Jersey
8,Male,2018,Elementary & middle school teachers,26390,272,New Jersey

In [73]:
# Save as a csv
path = ".\Output_Data"
Wage_by_gender_common_job_female.to_csv(os.path.join(path, 'Wage_by_gender_common_job_female.csv'))

In [79]:
# Save as a csv
path = ".\Output_Data"
Wage_by_gender_common_job_male.to_csv(os.path.join(path, 'Wage_by_gender_common_job_male.csv'))

In [80]:
#Export Table to Postgres Database
Wage_by_gender_common_job_female.to_sql(name='Wage_by_gender_common_job_female', con=engine, if_exists='append', index=False)

In [81]:
#Export Table to Postgres Database
Wage_by_gender_common_job_male.to_sql(name='Wage_by_gender_common_job_male', con=engine, if_exists='append', index=False)

#### D.CSV Source Four

In [82]:
#Clean wage distribution
Wage_Distribution.head()

,ID Wage Bin,Wage Bin,ID Year,Year,ID Workforce Status,Workforce Status,Total Population,Total Population MOE Appx,Record Count,Geography,ID Geography,Slug Geography,share
0,11,$100-110k,2018,2018,True,True,3994488,48408.844657,40446,United States,01000US,united-states,0.026718
1,21,$200k+,2018,2018,True,True,206142,10878.265107,2311,New Jersey,04000US34,new-jersey,0.047635
2,20,$190-200k,2018,2018,True,True,13784,2877.859766,148,New Jersey,04000US34,new-jersey,0.003185
3,2,$10-20k,2018,2018,True,True,18713295,99337.336833,168669,United States,01000US,united-states,0.125167
4,19,$180-190k,2018,2018,True,True,22945,3709.064473,262,New Jersey,04000US34,new-jersey,0.005302

In [83]:
Wage_Distribution = Wage_Distribution[['Wage Bin','Year','Total Population','Record Count','Geography']]

In [84]:
Wage_Distribution.head()

    Wage Bin  Year  Total Population  Record Count      Geography
0  $100-110k  2018           3994488         40446  United States
1     $200k+  2018            206142          2311     New Jersey
2  $190-200k  2018             13784           148     New Jersey
3    $10-20k  2018          18713295        168669  United States
4  $180-190k  2018             22945           262     New Jersey

In [85]:
# Save as a csv
path = ".\Output_Data"
Wage_Distribution.to_csv(os.path.join(path, 'Wage_Distribution.csv'))

In [86]:
#Export Table to Postgres Database
Wage_by_gender_common_job_female.to_sql(name='Wage_by_gender_common_job_female', con=engine, if_exists='append', index=False)

#### iii. Load

In [5]:
print(engine.table_names())

['wage_distribution', 'highest_paying', 'zips', 'median_household_income_race', 'wage_by_gender_common_job_female', 'wage_by_gender_common_job_male', 'Wage_by_gender_common_job_female', 'Wage_by_gender_common_job_male', 'Zips', 'Median_Household_Income_Race']

In [10]:
#Read sql table into pandas datafram
df1 = pd.read_sql("SELECT * FROM zips", con=engine)
df1.head()

   id     cities  zip_codes
0   0    Absecon       8201
1   1   Adelphia       7710
2   2    Allaire       7727
3   3  Allamuchy       7820
4   4  Allendale       7401

In [9]:
#Read sql table into pandas datafram
df2 = pd.read_sql("SELECT * FROM highest_paying", con=engine)
df2.head()

,id,detailed_occupation,year,average_wage,average_wage_appx_moe,record_count,geography
0,0,Surgeons,2018,346181.811220,126078.753693,28,New Jersey
1,1,"Securities, commodities, & financial services ...",2018,238809.692781,45880.602148,155,New Jersey
2,2,Chief executives & legislators,2018,220187.561079,20749.672598,500,New Jersey
3,3,Other financial specialists,2018,220077.199871,128114.746803,18,New Jersey
4,4,Podiatrists,2018,217798.366215,164558.500711,11,New Jersey

In [12]:
#Read sql table into pandas datafram
df3 = pd.read_sql("SELECT * FROM Wage_by_gender_common_job_male", con=engine)
df3.head()

,id,gender,year,detailed_occupation,total_population,record_count,geography
0,0,Male,2018,Driver/sales workers & truck drivers,79173,639,New Jersey
1,5,Male,2018,Registered nurses,9366,91,New Jersey
2,6,Male,2018,Retail salespersons,33038,311,New Jersey
3,7,Male,2018,Other managers,77553,793,New Jersey
4,8,Male,2018,Elementary & middle school teachers,26390,272,New Jersey

In [13]:
#Read sql table into pandas datafram
df4 = pd.read_sql("SELECT * FROM Wage_by_gender_common_job_female", con=engine)
df4.head()

,id,gender,year,detailed_occupation,total_population,record_count,geography
0,1,Female,2018,Driver/sales workers & truck drivers,4154,31,New Jersey
1,2,Female,2018,Retail salespersons,23044,207,New Jersey
2,3,Female,2018,Other managers,41971,449,New Jersey
3,4,Female,2018,Elementary & middle school teachers,91017,993,New Jersey
4,9,Female,2018,Registered nurses,68999,723,New Jersey